{"config": [{"config": {"bias_regularizer": null, "batch_input_shape": [null, 513], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_1", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_constraint": null, "units": 500}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 500}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_3", "activity_regularizer": null, "activation": "softmax", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 193}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8"}