{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dtype": "float32", "mask_zero": false, "input_dim": 120, "trainable": true, "input_length": 120, "batch_input_shape": [null, 120], "embeddings_regularizer": null, "activity_regularizer": null, "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "embeddings_constraint": null, "output_dim": 50}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "units": 50, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0, "stddev": 0.1, "seed": null}}, "implementation": 0, "recurrent_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "stateful": false, "go_backwards": false, "activation": "tanh", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "return_state": false, "name": "lstm_1", "unroll": false, "bias_constraint": null}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "units": 50, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0, "stddev": 0.1, "seed": null}}, "implementation": 0, "recurrent_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "stateful": false, "go_backwards": false, "activation": "tanh", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "return_state": false, "name": "lstm_2", "unroll": false, "bias_constraint": null}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "units": 50, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0, "stddev": 0.1, "seed": null}}, "implementation": 0, "recurrent_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "stateful": false, "go_backwards": false, "activation": "tanh", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "return_state": false, "name": "lstm_3", "unroll": false, "bias_constraint": null}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "units": 1, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null}}], "keras_version": "2.0.8", "backend": "tensorflow"}